import math

# print(10 + 10)  # сложение
# print(10 - 10)  # вычитание

# print(10 * 10)  # умножение
# print(10 / 10)  # деление вывод float
# print(19 // 10)  # целочисленное деление (отбрасывает дробную часть)

# print(19 % 10)  # остаток от деления

# print(2 ** 2)  # возведение в степень
# print(16 ** 0.5)  # извлечение из-под корня вывод будет float

# print(math.sqrt(16))  # извлечение из-под корня с помощью библиотеки вывод будет float
# print(math.exp(2))  # ... другие математические операции

print(15 < 4)  # меньше
print(15 > 4)  # больше
print(15 == 4)  # равно
print(15 != 4)  # не равно
print("python" == "python1")
print(15 <= 4)  # меньше или равно
print(15 >= 4)  # больше или равно

int1 = 3
int1 = int1 + 1
int1 += 1

int2 = 3
int2 = int2 - 1
int2 -= 1

int3 = 3
int3 = int3 * 1
int3 *= 1

# ....
